### AI-0102 Practice 5

**1.**

In [76]:
import numpy as np
import pandas as pd

**2.**

In [77]:
csv_in = 'running.csv'
df1 = pd.read_csv(csv_in, delimiter=',', skiprows=0, header=0)

**3.**

In [78]:
print( df1.shape )
print( df1.info() )
display( df1.head() )

(47, 4)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47 entries, 0 to 46
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      47 non-null     int64
 1   Univ    47 non-null     object
 2   Grade   47 non-null     int64
 3   Time    47 non-null     int64
dtypes: int64(3), object(1)
memory usage: 1.6+ KB
None

     ID Univ  Grade  Time
0  1001    D      3  1870
1  1004    C      1  1957
2  1006    D      2  2063
3  1007    D      3  1839
4  1008    C      2  1740

**4-value_counts**

In [79]:
ser1 = df1['Univ'].value_counts()
print( ser1 )

A    16
D    15
B     8
C     8
Name: Univ, dtype: int64

**4-groupby**

In [80]:
gb1 = df1.groupby('Univ').size()
print( gb1 )

Univ
A    16
B     8
C     8
D    15
dtype: int64

**5.**

In [81]:
ct = pd.crosstab( df1['Univ'], df1['Grade'], margins=True )
display( ct )

Grade   1   2   3   4  All
Univ
A       3   4   5   4   16
B       2   1   2   3    8
C       1   3   1   3    8
D       5   3   6   1   15
All    11  11  14  11   47

**6.**

In [82]:
gb2 = df1.groupby('Univ').mean()
print( gb2['Time'] )

Univ
A    1918.375000
B    1936.375000
C    1930.250000
D    1886.466667
Name: Time, dtype: float64

**7.**

In [83]:
pv1 = df1.pivot_table(index='Univ', columns='Grade', values=['Time'], aggfunc=np.mean)
display( pv1 )

              Time
Grade            1            2            3            4
Univ
A      1980.666667  1970.750000  1835.200000  1923.250000
B      1860.500000  1974.000000  2067.000000  1887.333333
C      1957.000000  1881.666667  1937.000000  1967.666667
D      1874.600000  1957.000000  1854.833333  1924.000000

**8.**

In [84]:
ser2 = pd.Series([9999, 'A', 1, 2222], index=df1.columns)
df2 = df1.append(ser2, ignore_index=True)
display( df2.tail() )

      ID Univ  Grade  Time
43  1047    B      2  1974
44  1048    D      2  1930
45  1049    A      4  1980
46  1050    B      4  1998
47  9999    A      1  2222

**9.**

In [85]:
df3 = df2.sort_values(by='Time')
display( df3.head() )

      ID Univ  Grade  Time
4   1008    C      2  1740
26  1030    D      3  1761
38  1042    A      3  1764
8   1012    A      3  1783
24  1028    B      4  1785

**10.**

In [86]:
df3['MinTime'] = df3['Time'] / 60.0
display( df3.head() )

      ID Univ  Grade  Time    MinTime
4   1008    C      2  1740  29.000000
26  1030    D      3  1761  29.350000
38  1042    A      3  1764  29.400000
8   1012    A      3  1783  29.716667
24  1028    B      4  1785  29.750000

**11.**

In [87]:
df4 = df3.drop(columns=['Univ', 'Grade'])
display( df4.head() )

      ID  Time    MinTime
4   1008  1740  29.000000
26  1030  1761  29.350000
38  1042  1764  29.400000
8   1012  1783  29.716667
24  1028  1785  29.750000